[
    {
		"id":1,
	"name" : "Oxford Union Debate",
	"desc" : "If you, as the debater, have ever wondered just how much you can sway the audience, the Oxford Union Debate is just the competition for you. It is a 1v1 debate; each debater prepares a stance assigned by the OC. Once the debaters have completed their speeches, the audience plays a crucial role and asks questions about the speeches and votes for the side which they think has the upper hand. With more than 70 participants, this is just one of our hugely packed events.",
	"img" : "Images/previousevents/oud.jpg"
}, 
{
	"id":2,
"name" : "Asian Parliamentary Debate",
	"desc" : "The Asian Parliamentary Debate is our flagship, fest-scale event conducted on an international level. With a higher team cap, quality core adjudication panel, and even higher prize money, the competition got even better to bring out the best in the pan-India participants, fighting for the top spot over three days. This APD saw 180+ participants; ranging from the prestigious Delhi Debating Circuits to International Invited Adjudicators. It is the largest of its kind in Eastern India.",
	"img" : "Images/previousevents/apd.png"
},
{
	"id":3,
"name" : "Incipio",
	"desc" : "Rome wasn’t built in a day, and neither was our love for debating. It takes time and skill to cultivate the critical thinking skills debating requires, and to help with that, Incipio is a workshop hosted by The Debating Society, NIT Durgapur. We believe in starting early, so the workshop is usually open to students from school as well as college. It was conducted online last year, with massive appreciation from participants.",
	"img" : "Images/previousevents/incipio.jpg"
},
{
	"id":4,
"name" : "Take Debait",
	"desc" : "An event packed with mystery and rife with danger, teams are assigned characters in a murder mystery plot. Each team works to find out who the killer is, while also defending themselves from suspicion. Teams are given clues every round to help them get to the bottom of the mystery, as they are simultaneously led astray by the false constructive of the other teams. The event was held virtually this year and saw 100+ participation.",
	"img" : "Images/previousevents/Takedebait.jpg"
},
{
	"id":5,
"name" : "Interface",
	"desc" : "The Debating Society does not stop at just public speaking events. As a well rounded society, last year, we hosted a panel discussion that helps college students with placement interviews, with a panel consisting of the established alumni of the college. The first day consisted of a panel discussion, wherein the alumni spoke about the skills necessary for an interview. On the second day, interested students were able to sit in a one-on-one mock interview, held by the members of the panel.",
	"img" : "Images/previousevents/interface.jpg"
},
{
	"id":6,
"name" : "Reverberate",
	"desc" : "We all know how it feels to have to present your ideas, only to find the right words aren’t available. A public speaking workshop, generally conducted at the start of the academic session here helps you overcome all those bouts of stuttering and gives us the confidence boost we all require. The workshop sees massive participation every year, and collects a lot of positive applause as well.",
	"img" : "Images/previousevents/Reverberate.jpg"
},
{
	"id":7,
"name" : "KillCode",
	"desc" : "One of the most interesting, and adrenaline filled events of the year is Kill Code by The Debating Society. The premise is that there's been a murder, and it looks like there will be more! The participants, as detectives, have to find out the killer and pattern in his string of his killings. However, unless you solve his cryptic puzzles, he is going to take another life. The participants must catch him and not let the killer get away!",
	"img" : "Images/previousevents/killcode.jpg"
},  {
		"id":8,
	"name" : "Ice Breaker",
	"desc" : "Ice Breaker was our event to initiate a conversation and to give first years an opportunity to think differently on a bit out-of-the-league topics. Participants were asked to send us their arguments either in support or in opposition, which were posted if they abided by the policies of Facebook. The participants with the maximum likes, comments, and shares plus considering OC’s views were chosen to be the winners.We received more than 120 responses from the first years.",
	"img" : "Images/upcoming/icebreaker.jpg"
}, 
{
	"id":9,
"name" : "Renegado",
	"desc" : "Renegado is a Turncoat debate, in its essence, where you betray your very own stance; that too, in the same breath. A debater is asked to prepare for both sides on a topic and switch their stance in between while speaking. It's an enthralling debate format that is often touted to be a critical assessment of a debater, wherein his/her arguments and rebuttals need to be equally balanced to furnish a great speech.",
	"img" : "Images/upcoming/rene.jpg"
},
{
	"id":10,
"name" : "Fictionary",
	"desc" : "A quiz event based on series, novels, films, and characters that find a special corner in our hearts. Fictionary gives us a breather from all the debating events in our repertoire. Participants have to be quick and witty to make the cut. Last year, Fictionary gathered over 500 participants. Performances were seen from every year, be it first, second, third, or the final year. We got to see a brilliant display of fast thinkers.",
	"img" : "Images/upcoming/fictionary.jpg"
},   {
		"id":11,
	"name" : "Know Your Campus",
	"desc" : "As seniors, we understand how exciting it is to gather information regarding the college. This series, Know Your Campus, was tailored for the new joinees with the motive of taking them through a virtual tour of the campus. Last year, this series extended over a week, with pictures and videos to go along with descriptions of places on campus.",
	"img" : "Images/ongoing/kyc.jpg"
},   {
		"id":12,
	"name" : "Jan Pehchan",
	"desc" : "One of the earliest events of the academic year, Jan Pehchaan is our official club orientation. Every year, we hold this event to introduce ourselves formally to the fresher batch, and answer their questions. It never boxes itself into just an orientation, with huge interaction between the juniors and seniors.",
	"img" : "Images/ongoing/janphehchan.jpeg"
},    {
		"id":13,
	"name" : "KILLCODE II",
	"desc" : "A body here, an end of the story there. How many stories are you willing to relive? Irrespective of whichever side you choose,Beware of the murderer(s) on the loose.Can you decipher the Kill Code before he/she/they come(s) for you, too? Eight for heaven, night for a hell;Ten to the devil where ever he may dwell. KILLCODE II Coming soon.",
	"img" : "Images/upcoming/killcode.jpg"
}, 
{
	"id":14,
"name" : "Reverberate '22",
	"desc" : "Words are the most powerful and impactful weapon that every human carries. To put forth our thoughts, ideas or even share our feelings, communication is the key.However, we all know that trying to convey yourself verbally isn't always easy. This is where we come in! We, the Debating Society, NIT Durgapur bring to you Reverberate '22, a fun and engaging workshop to help you improve your communication skills, enhance your critical thinking abilities, establish cohesive arguments.",
	"img" : "Images/upcoming/reverberate.jpg"
},
{
	"id":15,
"name" : "What If?",
	"desc" : "What if the world as you knew it, changed suddenly? How do you fare with unexpected situations and curveballs that life might throw your way in an alternate universe? We, the Debating Society, NIT Durgapur, bring to you What if?, an event that is sure to get you revved up. All you have to do is send us your video entries on the topics we provide you with. Accept the challenge and set the stage ablaze if you dare! ",
	"img" : "Images/upcoming/whatif.jpg"
}
]